Repository: scalingpythonml/scalingpythonml.github.io
Catalog: docs/subrepos/docker-stacks/docs/locale/*/LC_MESSAGES/index.po
Languages: it, pt_br

source: User Guide
it: Guida Utente
pt_br: Guia de uso

source: Contributor Guide
it: Come contribuire
pt_br: Guia de contribuição

source: Maintainer Guide
it: Guida per i Maintainer
pt_br: Guia de manutenção

source: Jupyter Discourse Forum
pt_br: Fórum do Jupyter

source: Jupyter Docker Stacks Issue Tracker
pt_br: Rastreamento de problemas nos containers Docker

source: Jupyter Website
pt_br: Website do Jupyter

source: Getting Help
it: Assistenza
pt_br: Obtendo ajuda

source: Jupyter Docker Stacks are a set of ready-to-run Docker images containing Jupyter applications and interactive computing tools. You can use a stack image to do any of the following (and more):
it: Jupyter Docker Stacks consiste in una collezione di immagini Docker pronte all'uso, contenenti applicazioni Jupyter e strumenti per l'interactive computing. Esse permettono di (e non solo):
pt_br: Jupyter Docker Stacks é um conjunto de imagens Docker prontas para uso contendo aplicações Jupyter e ferramentas interativas. Você pode usar uma pilha de imagens para fazer qualquer uma dessas coisas (e muito mais):

source: Start a personal Jupyter Notebook server in a local Docker container
it: Avviare un server personale Jupyter Notebook all'interno di un container Docker in locale
pt_br: Rodar um servidor Jupyter Notebook em um container Docker local

source: Run JupyterLab servers for a team using JupyterHub
it: Configurare un server JupyterLab da utilizzare con JupyterHub
pt_br: Rodar um servidor JupyterLab para uma equipe usando JupyterHub

source: Write your own project Dockerfile
it: Creare Dockerfile personalizzati
pt_br: Escrever seu próprio Dockerfile

source: Quick Start
it: Per iniziare
pt_br: Guia rápido

source: You can try a `recent build of the jupyter/base-notebook image on mybinder.org <https://mybinder.org/v2/gh/jupyter/docker-stacks/master?filepath=README.ipynb>`_ by simply clicking the preceding link. Otherwise, the two examples below may help you get started if you `have Docker installed <https://docs.docker.com/install/>`_, know :doc:`which Docker image <using/selecting>` you want to use, and want to launch a single Jupyter Notebook server in a container.
it: Potete provare `una build recente dell'immagine jupyter/base-notebook su mybinder.org <https://mybinder.org/v2/gh/jupyter/docker-stacks/master?filepath=README.ipynb>`_ cliccando sul link precedente. Oppure, i due esempi in basso potrebbero aiutarvi a muovere i primi passi se `avete installato Docker <https://docs.docker.com/install/>`_, avete scelto :doc:` l'immagine da utilizzare <using/selecting>` e volete lanciare un solo server Jupyter Notebook in un container.
pt_br: Você pode tentar um `build recente da imagem do jupyter/base-notebook em mybinder.org <https://mybinder.org/v2/gh/jupyter/docker-stacks/master?filepath=README.ipynb>`_ simplesmente clicando neste link. Caso contrário, os dois exemplos abaixo podem te ajudar a começar se você `já tem o Docker instalado <https://docs.docker.com/install/>`_ , sabe :doc:`qual imagem <using/selecting>` usar, e quer iniciar um servidor Jupyter Notebook em um contêiner.

source: The other pages in this documentation describe additional uses and features in detail.
it: Le altre pagine di questa documentazione descrivono nel dettaglio le varie funzionalità ed ulteriori casi d'uso.
pt_br: As próximas paginas desta documentação descrevem os usos e as funcionalidades adicionais com mais detalhes

source: **Example 1:** This command pulls the ``jupyter/scipy-notebook`` image tagged ``17aba6048f44`` from Docker Hub if it is not already present on the local host. It then starts a container running a Jupyter Notebook server and exposes the server on host port 8888. The server logs appear in the terminal. Visiting ``http://<hostname>:8888/?token=<token>`` in a browser loads the Jupyter Notebook dashboard page, where ``hostname`` is the name of the computer running docker and ``token`` is the secret token printed in the console. The container remains intact for restart after the notebook server exits.::
it: **Esempio 1:** Questo comando esegue il pull dell'immagine ``jupyter/scipy-notebook`` avente tag ``17aba6048f44`` da Docker Hub se non dovesse essere già presente sull'host locale. Poi avvia un container con un server Jupyter Notebook in ascolto sulla porta 8888 dell'host. I log del server compaiono nel terminale. All'indirizzo ``http://<hostname>:8888/?token=<token>`` è presente la dashboard di Jupyter Notebook. ``hostname`` indica il nome del computer dove Docker è avviato mentre ``token`` è il token segreto mostrato sul terminale. L'uscita dal server del notebook lascia intatto il container:
pt_br: **Exemplo 1:** Este comando faz um pull da imagem ``jupyter/scipy-notebook`` com a tag ``17aba6048f44`` do Docker Hub se ela ainda não estiver em sua maquina local. Em seguida inicia um contêiner executando um servidor Jupyter Notebook e expondo a porta 8888 do host. Os logs do servidor aparecem no terminal. Acessando o endereço ``http://<hostname>:8888/?token=<token>`` através de um navegador carregará o painel de controle do Jupyter Notebook, onde ``hostname`` é o nome do computador executando o docker e ``token`` é o token secreto exibido no console. O contêiner permanece intacto para reinicialização após o termino do servidor.::

source: **Example 2:** This command performs the same operations as **Example 1**, but it exposes the server on host port 10000 instead of port 8888. Visiting ``http://<hostname>:10000/?token=<token>`` in a browser loads JupyterLab, where ``hostname`` is the name of the computer running docker and ``token`` is the secret token printed in the console.::
it: **Esempio 2:** Questo comando esegue le stesse operazioni dell'**Esempio 1**, ma mette in ascolto il server sulla porta 10000 anziché 8888:
pt_br: **Exemplo 2:** Este comando faz as mesma coisas do **Exemplo 1**, mas expõe a porta 10000 do host em vez da 8888. Acessando o endereço ``http://<hostname>:10000/?token=<token>`` através de um navegador carregará o JupyterLab, onde ``hostname`` é o nome do computador executando o docker e ``token`` é o token secreto exibido no console.::

source: **Example 3:** This command pulls the ``jupyter/datascience-notebook`` image tagged ``9b06df75e445`` from Docker Hub if it is not already present on the local host. It then starts an *ephemeral* container running a Jupyter Notebook server and exposes the server on host port 10000. The command mounts the current working directory on the host as ``/home/jovyan/work`` in the container. The server logs appear in the terminal. Visiting ``http://<hostname>:10000/?token=<token>`` in a browser loads JupyterLab, where ``hostname`` is the name of the computer running docker and ``token`` is the secret token printed in the console. Docker destroys the container after notebook server exit, but any files written to ``~/work`` in the container remain intact on the host.::
it: **Esempio 3:** Questo comando esegue il pull dell'immagine ``jupyter/datascience-notebook`` avente tag ``9b06df75e445`` da Docker Hub se non dovesse essere già presente sull'host locale. Poi avvia un container *effimero* con un server Jupyter Notebook in ascolto sulla porta 10000. Inoltre, il comando monta la directory di lavoro corrente dell'host come ``/home/jovyan/work`` all'interno del container. I log del server compaiono nel terminale. All'indirizzo ``http://<hostname>:10000/?token=<token>`` è presente la dashboard di Jupyter Notebook. ``hostname`` indica il nome del computer dove Docker è avviato mentre ``token`` è il token segreto mostrato sul terminale. Docker distrugge il container all'uscita del server del notebook, tuttavia i file salvati in ``~/work`` all'interno del container restano inalterati sull'host:
pt_br: **Exemplo 3:** Este comando faz um pull da imagem ``jupyter/datascience-notebook`` com a tag ``9b06df75e445`` do Docker Hub se ela ainda não estiver em sua maquina local. Em seguida inicia um contêiner *passageiro* rodando um servidor Jupyter Notebook expondo no host a porta 10000 do servidor. O comando associa o diretório atual do host com o diretório ``/home/jovyan/work`` do contêiner. Os logs do servidor aparecem no terminal. Acessando o endereço ``http://<hostname>:10000/?token=<token>`` através de um navegador carregará o JupyterLab, onde ``hostname`` é o nome do computador executando o docker e ``token`` é o token secreto exibido no console. O Docker destrói o contêiner depois que o servidor for finalizado, mas os arquivos escritos em ``~work`` do contêiner permanecem intactos no host.::

source: Table of Contents
it: Indice
pt_br: Índice
